OpenFOAMfiles/turbulent/machineLES/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0 0 0)
    (2 0 0)
    (2.5 0 0)
    (4.5 0 0)
    (0 1.0 0)
    (2 1.0 0)
    (2.5 1.0 0)
    (4.5 1.0 0)
    (0 4 0)
    (2 4 0)
    (2.5 4 0)
    (4.5 4 0)
    (0 0 0.1)
    (2 0 0.1)
    (2.5 0 0.1)
    (4.5 0 0.1)
    (0 1.0 0.1)
    (2 1.0 0.1)
    (2.5 1.0 0.1)
    (4.5 1.0 0.1)
    (0 4 0.1)
    (2 4 0.1)
    (2.5 4 0.1)
    (4.5 4 0.1)
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (100 50 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (100 50 1) simpleGrading (1 1 1)
    hex (4 5 9 8 16 17 21 20) (100 150 1) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21) (25 150 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (100 150 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 12 16 4)
            (4 16 20 8)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (7 19 15 3)
            (11 23 19 7)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (1 5 17 13)
            (5 6 18 17)
            (2 14 18 6)
            (2 3 15 14)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
